# coding=utf-8
# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

b = int(input())
h = int(input())
print(b * h / 2)
