# coding=utf-8
# Дано трехзначное число. Найдите сумму его цифр.

n = int(input())

print(int(str(n)[0])+int(str(n)[1])+int(str(n)[2]))