# coding=utf-8
# Дано натуральное число. Выведите его последнюю цифру.

n = int(input())

print(str(n)[-1])