# coding=utf-8
# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:

name = input()
print('Hello, ' + name + '!')